{
    "Job Title": "Frontend and Full Stack Engineering Intern",
    "Job Description": "Ramp is seeking frontend and full stack engineering interns to join their engineering team. The interns will be responsible for building performant, beautiful, and usable interfaces that solve complex needs for growing businesses. They will work in cross-functional teams, incorporate customer feedback, and help establish engineering processes and systems. The ideal candidate is currently pursuing a B.S. in Computer Science or a related field, has proficiency in JavaScript and object-oriented programming languages, and has a track record of shipping high-quality products. They should have a desire to work in a fast-paced environment and align with Ramp's core values.",
    "Prerequisites": "Currently pursuing a B.S. (or higher) in Computer Science or a related technical field, with an expected graduation date between 2023 - 2025. Proficiency in JavaScript, with a knack for getting the visuals right. Experience with one or more object-oriented programming languages. Track record of shipping high quality products and features or a portfolio of side projects. Ability to turn business and product ideas into engineering solutions. Desire to work in a fast-paced environment, continuously grow, and master your craft. Alignment with Ramp's core values of enabling businesses to grow more by spending less.",
    "Preferred Qualifications": "Proficiency in React v16+. Familiarity with or desire to learn our tech stack which includes, but not limited to: Flask (Python), Elixir, AWS, RabbitMQ, PostgreSQL. Passion for, or curiosity to learn, financial technology.",
    "Others": "The hourly rate for this internship is $60 USD + housing stipend. Ramp offers benefits such as a M1 Pro Macbook Pro, catered lunches in NYC office, 100% medical, dental & vision insurance coverage, 401k with employer match, flexible PTO, fertility HRA, WFH stipend, wellness stipend, parental leave, relocation support, and pet insurance."
  }
  