{
  "Job Title": "Summer Interm Data Science Internship",
  "Job Description": "Live our Values\nCulture Champion\n- Models the Walmart values to foster our culture; holds oneself and others accountable; and supports Walmart's commitment to communities, social justice, corporate social responsibility, and sustainability; maintains and promotes the highest standards of integrity, ethics and compliance.\nServant Leadership\n- Acts as an altruistic servant leader and is consistently humble, self-aware, honest, and transparent.\nEmbrace Change\nCuriosity & Courage\n- Demonstrates curiosity and a growth mindset; fosters an environment that supports learning, innovation, and intelligent risk-taking; and exhibits resilience in the face of setbacks.\nDigital Transformation & Change\n- Seeks and implements continuous improvements and encourages the team to leverage new digital tools and ways of working.\nDeliver for the Customer\nCustomer Focus\n- Delivers expected business results while putting the customer first and consistently applying an omni-merchant mindset and the EDLP and EDLC business models to all plans.\nStrategic Thinking\n- Adopts a holistic perspective that considers data, analytics, customer insights, and different parts of the business when making plans and shaping the team's strategy.\nFocus on our Associates\nDiversity, Equity & Inclusion\n- Identifies, attracts, and retains diverse and inclusive team members; builds a high-performing team; embraces diversity in all its forms; and actively supports diversity goal programs.\nCollaboration & Influence\n- Builds strong and trusting relationships with team members and business partners; works collaboratively and cross-functionally to achieve objectives; and communicates with energy and positivity to motivate, influence, and inspire commitment and action.\nTalent Management\n- Creates a discipline and focus around developing talent, promotes an environment allowing everyone to bring their best selves to work, empowers associates and partners to act in the best interest of the customer and company, and regularly recognizes others' contributions and accomplishments.",
  "Prerequisites": "Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.",
  "Preferred Qualifications": "Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications."
}